#প্রথম দুটি ফিবনাচ্চি সংখ্যা হচ্ছে ১ ও ১। তারপর থেকে যেকোনো ফিবনাচ্চি সংখ্যা হবে তার আগের দুটি ফিবনাচ্চি সংখ্যার যোগফল।
#ফিবনাচ্চি সংখ্যাগুলো পর পর লিখলে যে ধারাটি আমরা পাই তাকেই বলে ফিবনাচ্চি ধারা।
#1, 1, 2, 3, 5, 8, 13, 21, 34, 55.... এভাবে চলবে। এখন আমাদের কাজ হচ্ছে বেবহারকারিদের কাছ থেকে একটি সংখ্যা n ইনপুট নেওয়া
#এবং n-তম ফিবনাচ্চি সংখ্যা প্রিন্ট করা।

# n = int(input("giv an number "))
# 
# fib_x = 1
# fib_next = 1
# 
# if n <= 2:
#     fib_n = 1
# else:
#     i = 3
#     while i <= n:
#         i += 1
#         fib_temp = fib_x + fib_next
#         fib_x = fib_next
#         fib_next = fib_temp
#         
#     fib_n = fib_next
# print(fib_n)

# import turtle
# r = 120
# a = 360
# turtle.circle(r, a)